Revit 2017 API
AssetPropertyDouble Class
Represents a property of double value.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyDouble : AssetProperty
Visual Basic
Public Class AssetPropertyDouble _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyDouble : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyDouble
See Also
AssetPropertyDouble Members
Autodesk.Revit.Utility Namespace